_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ОпределениеМерыГотовностиРаботПоДоговоруПодряда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ОпределениеМерыГотовностиРаботПоДоговоруПодряда</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_СуммыНепредъявленнойВыручки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПоВедущейРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацииМерыГотовностиРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУсловийДоговораНаДатуРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПредставленияДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъемРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВедущийПроцесс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНЗПНаДатуРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыКСписаниюСНачалаПроекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыКСписаниюВТекущемПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйОстатокНЗПНаКонецПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДоходам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлановаяВыручка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыручкаПоСправкам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазностьПланФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ДанныеРеестраДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ДанныеРеестраДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСуммаПоДоговоруСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСуммаПоДоговоруСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоРасчетаПБУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРасчетаПБУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаВыручкиПоПБУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СпособРасчетаВыручкиПоПБУ_2_2008</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ПлановыеДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ПлановыеДоходыРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланируемаяСуммаРасходовПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемаяСуммаДоходовПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ОпределениеМерыГотовностиРаботПоДоговоруПодряда/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыФормы;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура 	ПриОткрытии(Отказ)													
	
	ПараметрыФормы = ПолучитьСтруктуруПараметров();
	
	ОтображатьГруппуПродукцииРасходыПриИзменении(Неопределено);
	ОтображатьПодразделениеРасходыПриИзменении(Неопределено);
	ОтображатьНоменклатурнуюГруппуВыручкаПриИзменении(Неопределено);
	ОтображатьПодразделениеВыручкаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура 	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)					
	
	ЗаполнитьДеревоПоТабличнойЧасти(Истина);
	ПолучитьСуммуУсловийДоговора();
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	
	СправкиПоВыручке.Параметры.УстановитьЗначениеПараметра("ТаблицаСсылок",				Новый Массив);
	СправкиПоВыручке.Параметры.УстановитьЗначениеПараметра("ГруппаФинансовогоУчета", 	Справочники.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка());
	
	Элементы.ОбъемРаботВедущийПроцесс.ТолькоПросмотр = НЕ Объект.СпособРасчетаПоВедущейРаботе;
	
	СтруктураНастроек = Объект.Ссылка.НастройкиПредставленияДокумента.Получить();
	Если ЗначениеЗаполнено(СтруктураНастроек) И ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		Если СтруктураНастроек.Свойство("ОтображатьГруппуПродукцииРасходы") Тогда
			ОтображатьГруппуПродукцииРасходы = СтруктураНастроек.ОтображатьГруппуПродукцииРасходы;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ОтображатьНоменклатурнуюГруппуВыручка") Тогда
			ОтображатьНоменклатурнуюГруппуВыручка = СтруктураНастроек.ОтображатьНоменклатурнуюГруппуВыручка;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ОтображатьПодразделениеВыручка") Тогда
			ОтображатьПодразделениеВыручка = СтруктураНастроек.ОтображатьПодразделениеВыручка;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ОтображатьПодразделениеРасходы") Тогда
			ОтображатьПодразделениеРасходы = СтруктураНастроек.ОтображатьПодразделениеРасходы;
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура 	ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)		
	
	ДеревоОбъемРабот = РеквизитФормыВЗначение("ОбъемРабот");
	ТекущийОбъект.ОбъемРабот.Очистить();
	ПреобразоватьВТЗРекурсия(ДеревоОбъемРабот, ТекущийОбъект.ОбъемРабот);
	
	СтруктураНастроек = Новый Структура("ОтображатьГруппуПродукцииРасходы, ОтображатьНоменклатурнуюГруппуВыручка, ОтображатьПодразделениеВыручка, ОтображатьПодразделениеРасходы", 
										ОтображатьГруппуПродукцииРасходы, ОтображатьНоменклатурнуюГруппуВыручка, ОтображатьПодразделениеВыручка, ОтображатьПодразделениеРасходы);
	
	Сжатие = Новый СжатиеДанных(9);
	ТекущийОбъект.НастройкиПредставленияДокумента = Новый ХранилищеЗначения(СтруктураНастроек, Сжатие);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
#КонецОбласти

#Область Прочее

&НаСервере
Функция		ПолучитьСтруктуруПараметров()										
	
	ПараметрыФормы = Новый Структура;
		
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура 	ПреобразоватьВТЗРекурсия(тДерево, тТаблица)							
	
	Для Каждого ТекСтрокаДЗ Из тДерево.Строки Цикл
		НоваяСтрокаТЗ = тТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ТекСтрокаДЗ);
		
		Если ТекСтрокаДЗ.Строки.Количество() > 0 Тогда
			ПреобразоватьВТЗРекурсия(ТекСтрокаДЗ, тТаблица);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура 	ЗаполнитьДеревоПоТабличнойЧасти(ПриОткрытии = Ложь)					
	
	Если Не ПриОткрытии Тогда
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	Запрос = Новый Запрос;

	Если НовыйВариант Тогда
		
		Запрос.УстановитьПараметр("ТабРабот",Объект.ОбъемРабот.Выгрузить());
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТабРабот.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
		|	ТабРабот.ОбъемФакт КАК ОбъемФакт,
		|	ТабРабот.ПроцентВыполнения КАК ПроцентВыполнения
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабРабот КАК ТабРабот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Работа КАК Работа,
		|	ВрТаб.Работа.ОбъемРаботы КАК ОбъемРаботы,
		|	ВрТаб.Работа.ЕдиницаОбъема КАК ЕдиницаОбъема,
		|	ВрТаб.Работа.ДатаНачала КАК ДатаНачала,
		|	ВрТаб.Работа.ДатаОкончания КАК ДатаОкончания,
		|	ВрТаб.ОбъемФакт КАК ОбъемФакт,
		|	ВрТаб.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ВрТаб.Работа.ВедущийПроцесс КАК ВедущийПроцесс,
		|	ВрТаб.Работа.СуммарнаяРабота КАК СуммарнаяРабота
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|ГДЕ
		|	НЕ ВрТаб.Работа.СуммарнаяРабота
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВрТаб.Работа.НомерРаботыВУровне
		|ИТОГИ ПО
		|	Работа ИЕРАРХИЯ";
		
		ДеревоЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	    ДеревоРабот = РеквизитФормыВЗначение("ОбъемРабот");
		ДеревоРабот.Строки.Очистить();
		
		Для Каждого СтрокаЗапроса ИЗ ДеревоЗапроса.Строки Цикл
			
			ВывестиДеревоРабот(СтрокаЗапроса,ДеревоРабот);			
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоРабот,"ОбъемРабот");		
		
		Возврат;
	КонецЕсли; 
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.Работа КАК Работа,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.Работа.Родитель КАК РаботаРодитель,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ДатаНачала,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ДатаОкончания,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ОбъемПлан,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ЕдИзм,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ВедущийПроцесс,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ОбъемФакт,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.ПроцентВыполнения,
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.Работа.СуммарнаяРабота КАК СуммарнаяРабота
	|ИЗ
	|	Документ.УСОERP_ОпределениеМерыГотовностиРаботПоДоговоруПодряда.ОбъемРабот КАК ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот
	|ГДЕ
	|	ОпределениеМерыГотовностиРаботПоДоговоруПодрядаОбъемРабот.Ссылка = &Ссылка";
				   				   
	Дерево_ОбъемРабот = РеквизитФормыВЗначение("ОбъемРабот");  	
		
	ДанныеДляДерева   = Запрос.Выполнить().Выгрузить();
	ВыражениеИсточник = "Работа";
	ВыражениеПриемник = "РаботаРодитель" ;
	Справочник        = Справочники.УСОERP_СтроительныеРаботы;
	Дерево_ОбъемРабот     = УСОERP_ОбработкаТабличныхЧастей.УСОERP_ПодготовитьДанныеИСформироватьДеревоСВосстановлениемСтруктуры(ДанныеДляДерева,ВыражениеИсточник,ВыражениеПриемник,,Справочник); 
	
	ВремРодноеДерево = РеквизитФормыВЗначение("ОбъемРабот"); // берется родная структура с родной типизацией
	ВремРодноеДерево.Строки.Очистить();
	УСОERP_ОбработкаТабличныхЧастей.УСОERP_ЗаполнитьРоднуюСтруктуруДереваИзВнешнего(ВремРодноеДерево.Строки, Дерево_ОбъемРабот.Строки); // и рекурсивно заполняется из дерева, где, возможн, типиация создаст проблемы
	ЗначениеВРеквизитФормы(ВремРодноеДерево, "ОбъемРабот");
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОтображатьГруппуПродукцииРасходыПриИзменении(Элемент)				
	
	Элементы.РасходыГруппаПродукции.Видимость = ОтображатьГруппуПродукцииРасходы;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОтображатьПодразделениеРасходыПриИзменении(Элемент)					

	Элементы.РасходыПодразделение.Видимость = ОтображатьПодразделениеРасходы;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОтображатьНоменклатурнуюГруппуВыручкаПриИзменении(Элемент)			

	Элементы.ВыручкаНоменклатурнаяГруппа.Видимость = ОтображатьНоменклатурнуюГруппуВыручка;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОтображатьПодразделениеВыручкаПриИзменении(Элемент)					

	Элементы.ВыручкаПодразделение.Видимость 			= ОтображатьПодразделениеВыручка;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ВидОперацииПриИзменении(Элемент)									
	
	ВидОперацииПриИзмененииНаСервереБезКонтекста();

КонецПроцедуры

&НаСервере
Процедура 	ВидОперацииПриИзмененииНаСервереБезКонтекста()						
	
	Если Объект.ВидОперации = Перечисления.УСОERP_ВидыОперацииМерыГотовностиРабот.РасчетВыручкиПоДолеПонесенныхРасходов Тогда
		Элементы.ГруппаОбъемРабот.Видимость = Ложь;
	Иначе
		Элементы.ГруппаОбъемРабот.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОбъектСтроительстваПриИзменении(Элемент)							

	Объект.Сценарий = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	Объект.ДокументУтверждения = УСОERP_ЗащищенныеФункцииСервер.ПолучитьПоследнийДокументУтверждения(Объект.ОбъектСтроительства,Объект.Организация);
	ДокументУтвержденияПриИзмененииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура 	ПолучитьСуммуУсловийДоговора()										
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(УСОERP_ДанныеРеестраДоговоровСрезПоследних.ТекущаяСуммаПоДоговоруСНДС, 0)) КАК СуммаУсловийДоговора
		|ИЗ
		|	РегистрСведений.УСОERP_ДанныеРеестраДоговоров.СрезПоследних(
		|			&ДатаДокумента,
		|			Договор = &Договор
		|				И Контрагент = &Контрагент
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация) КАК УСОERP_ДанныеРеестраДоговоровСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", 			Объект.Дата);
	Запрос.УстановитьПараметр("Договор", 				Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Объект.СуммаУсловийДоговораНаДатуРасчета = Выборка.СуммаУсловийДоговора;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура 	ОчиститьВыручка(Команда)											
	
	Объект.Выручка.Очистить();
	СправкиПоВыручке.Параметры.УстановитьЗначениеПараметра("ТаблицаСсылок",	Новый Массив);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОчиститьОбъемРабот(Команда)											
	
	ОбъемРабот.ПолучитьЭлементы().Очистить();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОчиститьРасходы(Команда)											
	
	Объект.Расходы.Очистить();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьОбъемРабот(Команда)										

	ОчиститьОбъемРабот(Неопределено);
	ЗаполнитьОбъемРаботНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура 	ЗаполнитьОбъемРаботНаСервере()
	
	Если Объект.Сценарий.НовыйВариант И НЕ ЗначениеЗАполнено(Объект.ДокументУтверждения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран документ утверждения!",,"ДокументУтверждения");
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;                                                      
	
	Запрос.УстановитьПараметр("ДатаДокумента", 			?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаНачала", 			Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Дата(3999,1,1)));
	Запрос.УстановитьПараметр("СценарийПланирования", 	Объект.Сценарий);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);

	
	Если НовыйВариант Тогда 		
		
		Запрос.УстановитьПараметр("КопияСценария",Объект.ДокументУтверждения.КопияСценария);
		Запрос.УстановитьПараметр("ДокументУтверждения",Объект.ДокументУтверждения);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа,
		|	УСОERP_СтроительныеРаботы.ДатаНачала КАК ДатаНачала,
		|	УСОERP_СтроительныеРаботы.ДатаОкончания КАК ДатаОкончания,
		|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема КАК ЕдИзм,
		|	УСОERP_СтроительныеРаботы.ОбъемРаботы КАК ОбъемПлан,
		|	УСОERP_СтроительныеРаботы.ВедущийПроцесс КАК ВедущийПроцесс,
		|	СУММА(УСОERP_УчетВыполненныхРабот.Объем) КАК ОбъемФакт,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(УСОERP_СтроительныеРаботы.ОбъемРаботы, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ УСОERP_УчетВыполненныхРабот.Объем / УСОERP_СтроительныеРаботы.ОбъемРаботы * 100
		|		КОНЕЦ) КАК ПроцентВыполнения
		|ПОМЕСТИТЬ РаботыФакт
		|ИЗ
		|	РегистрНакопления.УСОERP_УчетВыполненныхРабот КАК УСОERP_УчетВыполненныхРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|		ПО УСОERP_УчетВыполненныхРабот.Работа = УСОERP_СтроительныеРаботы.РаботаИсточник
		|ГДЕ
		|	УСОERP_УчетВыполненныхРабот.Организация = &Организация
		|	И УСОERP_УчетВыполненныхРабот.ОбъектСтроительства = &ОбъектСтроительства
		|	И НАЧАЛОПЕРИОДА(УСОERP_УчетВыполненныхРабот.Период, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
		|	И УСОERP_СтроительныеРаботы.Владелец = &КопияСценария
		|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_СтроительныеРаботы.Ссылка,
		|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема,
		|	УСОERP_СтроительныеРаботы.ВедущийПроцесс,
		|	УСОERP_СтроительныеРаботы.ОбъемРаботы,
		|	УСОERP_СтроительныеРаботы.ДатаНачала,
		|	УСОERP_СтроительныеРаботы.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланГрафикРаботы.Работа КАК Работа,
		|	ПланГрафикРаботы.Работа.Родитель КАК РаботаРодитель,
		|	ПланГрафикРаботы.НачалоРаботыПлан КАК ДатаНачала,
		|	ПланГрафикРаботы.ОкончаниеРаботыПлан КАК ДатаОкончания,
		|	ПланГрафикРаботы.ЕдиницаОбъема КАК ЕдИзм,
		|	ПланГрафикРаботы.ОбъемРаботы КАК ОбъемПлан,
		|	ПланГрафикРаботы.Работа.ВедущийПроцесс КАК ВедущийПроцесс,
		|	0 КАК ОбъемФакт,
		|	0 КАК ПроцентВыполнения
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК ПланГрафикРаботы
		|ГДЕ
		|	(ПланГрафикРаботы.НачалоРаботыПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ ПланГрафикРаботы.ОкончаниеРаботыПлан МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|	И НЕ ПланГрафикРаботы.Работа В
		|				(ВЫБРАТЬ
		|					РаботыФакт.Работа КАК Работа
		|				ИЗ
		|					РаботыФакт КАК РаботыФакт)
		|	И ПланГрафикРаботы.Ссылка = &ДокументУтверждения
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботыФакт.Работа,
		|	РаботыФакт.Работа.Родитель,
		|	РаботыФакт.ДатаНачала,
		|	РаботыФакт.ДатаОкончания,
		|	РаботыФакт.ЕдИзм,
		|	РаботыФакт.ОбъемПлан,
		|	РаботыФакт.ВедущийПроцесс,
		|	РаботыФакт.ОбъемФакт,
		|	РаботыФакт.ПроцентВыполнения
		|ИЗ
		|	РаботыФакт КАК РаботыФакт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Работа КАК Работа,
		|	ВрТаб.Работа.ДатаНачала КАК ДатаНачала,
		|	ВрТаб.Работа.ДатаОкончания КАК ДатаОкончания,
		|	ВрТаб.Работа.ЕдиницаОбъема КАК ЕдИзм,
		|	ВрТаб.Работа.ОбъемРаботы КАК ОбъемПлан,
		|	ВрТаб.Работа.ВедущийПроцесс КАК ВедущийПроцесс,
		|	ВрТаб.ОбъемФакт КАК ОбъемФакт,
		|	ВрТаб.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ВрТаб.Работа.СуммарнаяРабота КАК СуммарнаяРабота
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВрТаб.Работа.НомерРаботыВУровне
		|ИТОГИ
		|	ВЫБОР
		|		КОГДА СуммарнаяРабота
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ОбъемФакт)
		|	КОНЕЦ КАК ОбъемФакт,
		|	ВЫБОР
		|		КОГДА СуммарнаяРабота
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ПроцентВыполнения) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Работа)
		|	КОНЕЦ КАК ПроцентВыполнения
		|ПО
		|	Работа ИЕРАРХИЯ";
		
		ДеревоЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ДеревоДанных = РеквизитФормыВЗначение("ОбъемРабот");
		
		ДеревоДанных.Строки.Очистить();
		
		Для Каждого СтрокаЗапроса ИЗ ДеревоЗапроса.Строки Цикл
			
			ВывестиДеревоРабот(СтрокаЗапроса,ДеревоДанных);		
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоДанных,"ОбъемРабот");
		
		Возврат;
		
	КонецЕсли;
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УСОERP_УчетВыполненныхРабот.Работа КАК Работа,
		|	МАКСИМУМ(ЕСТЬNULL(УСОERP_УчетВыполненныхРабот.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаНачала,
		|	МАКСИМУМ(ЕСТЬNULL(УСОERP_УчетВыполненныхРабот.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОкончания,
		|	УСОERP_УчетВыполненныхРабот.ЕдиницаОбъема КАК ЕдИзм,
		|	ЕСТЬNULL(УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы, 0) КАК ОбъемПлан,
		|	УСОERP_УчетВыполненныхРабот.Работа.ВедущийПроцесс КАК ВедущийПроцесс,
		|	СУММА(УСОERP_УчетВыполненныхРабот.Объем) КАК ОбъемФакт,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ УСОERP_УчетВыполненныхРабот.Объем / УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы * 100
		|		КОНЕЦ) КАК ПроцентВыполнения
		|ПОМЕСТИТЬ РаботыФакт
		|ИЗ
		|	РегистрНакопления.УСОERP_УчетВыполненныхРабот КАК УСОERP_УчетВыполненныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|				&ДатаДокумента,
		|				Утверждена
		|					И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
		|		ПО УСОERP_УчетВыполненныхРабот.Работа = УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа
		|ГДЕ
		|	УСОERP_УчетВыполненныхРабот.Организация = &Организация
		|	И УСОERP_УчетВыполненныхРабот.ОбъектСтроительства = &ОбъектСтроительства
		|	И НАЧАЛОПЕРИОДА(УСОERP_УчетВыполненныхРабот.Период, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_УчетВыполненныхРабот.Работа,
		|	УСОERP_УчетВыполненныхРабот.ЕдиницаОбъема,
		|	УСОERP_УчетВыполненныхРабот.Работа.ВедущийПроцесс,
		|	ЕСТЬNULL(УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланГрафикРаботы.Работа КАК Работа,
		|	ПланГрафикРаботы.Работа.Родитель КАК РаботаРодитель,
		|	ПланГрафикРаботы.НачалоРаботыПлан КАК ДатаНачала,
		|	ПланГрафикРаботы.ОкончаниеРаботыПлан КАК ДатаОкончания,
		|	ПланГрафикРаботы.ЕдиницаОбъема КАК ЕдИзм,
		|	ПланГрафикРаботы.ОбъемРаботы КАК ОбъемПлан,
		|	ПланГрафикРаботы.Работа.ВедущийПроцесс КАК ВедущийПроцесс,
		|	0 КАК ОбъемФакт,
		|	0 КАК ПроцентВыполнения
		|ИЗ
		|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК ПланГрафикРаботы
		|ГДЕ
		|	(ПланГрафикРаботы.НачалоРаботыПлан МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ ПланГрафикРаботы.ОкончаниеРаботыПлан МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|	И ПланГрафикРаботы.Ссылка.Организация = &Организация
		|	И ПланГрафикРаботы.Ссылка.ОбъектСтроительства = &ОбъектСтроительства
		|	И ПланГрафикРаботы.Ссылка.СценарийПланирования = &СценарийПланирования
		|	И ПланГрафикРаботы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
		|	И НАЧАЛОПЕРИОДА(ПланГрафикРаботы.Ссылка.Дата, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
		|	И НЕ ПланГрафикРаботы.Работа В
		|				(ВЫБРАТЬ
		|					РаботыФакт.Работа
		|				ИЗ
		|					РаботыФакт КАК РаботыФакт)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботыФакт.Работа,
		|	РаботыФакт.Работа.Родитель,
		|	РаботыФакт.ДатаНачала,
		|	РаботыФакт.ДатаОкончания,
		|	РаботыФакт.ЕдИзм,
		|	РаботыФакт.ОбъемПлан,
		|	РаботыФакт.ВедущийПроцесс,
		|	РаботыФакт.ОбъемФакт,
		|	РаботыФакт.ПроцентВыполнения
		|ИЗ
		|	РаботыФакт КАК РаботыФакт"; 		
		
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляДерева   = Запрос.Выполнить().Выгрузить();
	ВыражениеИсточник = "Работа";
	ВыражениеПриемник = "РаботаРодитель" ;
	Справочник        = Справочники.УСОERP_СтроительныеРаботы;
	Дерево_ОбъемРабот     = УСОERP_ОбработкаТабличныхЧастей.УСОERP_ПодготовитьДанныеИСформироватьДеревоСВосстановлениемСтруктуры(ДанныеДляДерева,ВыражениеИсточник,ВыражениеПриемник,,Справочник); 
	
	ВремРодноеДерево = РеквизитФормыВЗначение("ОбъемРабот"); // берется родная структура с родной типизацией
	ВремРодноеДерево.Строки.Очистить();
	УСОERP_ОбработкаТабличныхЧастей.УСОERP_ЗаполнитьРоднуюСтруктуруДереваИзВнешнего(ВремРодноеДерево.Строки, Дерево_ОбъемРабот.Строки); // и рекурсивно заполняется из дерева, где, возможн, типиация создаст проблемы
	ЗначениеВРеквизитФормы( ВремРодноеДерево, "ОбъемРабот");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура  	ВывестиДеревоРабот(СтрокаЗапроса,ДеревоДанных)
	
	СтрокаДерева = ДеревоДанных.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева,СтрокаЗапроса);
	
	Для Каждого ПодСтрока ИЗ СтрокаЗапроса.Строки Цикл
		Если ПодСтрока.Работа = СтрокаЗапроса.Работа Тогда
			Продолжить;
		КонецЕсли;
		
		ВывестиДеревоРабот(ПодСтрока,СтрокаДерева);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьРасходы(Команда)											
	
	ОчиститьРасходы(Неопределено);
	ПлановыеДоходыРасходы.Очистить();
	ЗаполнитьРасходыНаСервере();
	Если ПлановыеДоходыРасходы.Количество() <> 0 Тогда
		ОткрытьФорму("Документ.УСОERP_ОпределениеМерыГотовностиРаботПоДоговоруПодряда.Форма.НезаполненныеДоходыРасходы", Новый Структура("ОтборДинамическогоСписка, Заголовок", ПлановыеДоходыРасходы, "Список плановых доходов/расходов с пустыми номенклатурными группами, либо подразделениями"),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура 	ЗаполнитьРасходыНаСервере()											
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеДоходыРасходыОбороты.Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК НоменклатурнаяГруппа,
		|	СУММА(ЕСТЬNULL(ПлановыеДоходыРасходыОбороты.ПланируемаяСуммаРасходовПоДоговоруОборот, 0)) КАК РасходПлан
		|ПОМЕСТИТЬ ПлановыеРасходы
		|ИЗ
		|	РегистрНакопления.УСОERP_ПлановыеДоходыРасходы.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Договор = &Договор
		|				И Контрагент = &Контрагент
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация) КАК ПлановыеДоходыРасходыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеДоходыРасходыОбороты.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.ПодразделениеКт КАК Подразделение,
		|	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК НоменклатурнаяГруппа,
		|	СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот) КАК РасходФакт
		|ПОМЕСТИТЬ Д90КТ20
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, , СчетДт.Родитель = &СчетДт, , СчетКт = &СчетКт, , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОборотыДтКт.СубконтоКт3,
		|	ХозрасчетныйОборотыДтКт.ПодразделениеКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК НоменклатурнаяГруппа,
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстатокНЗПНаДатуРасчета
		|ПОМЕСТИТЬ Счет20
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОкончания, Счет = &СчетКт, , Организация = &Организация) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Д90КТ20.Подразделение, Счет20.Подразделение) КАК Подразделение,
		|	ЕСТЬNULL(Д90КТ20.НоменклатурнаяГруппа, Счет20.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
		|	ЕСТЬNULL(Д90КТ20.РасходФакт, 0) КАК РасходФакт,
		|	ЕСТЬNULL(Счет20.ОстатокНЗПНаДатуРасчета, 0) КАК ОстатокНЗПНаДатуРасчета
		|ПОМЕСТИТЬ ДанныеРегБух
		|ИЗ
		|	Д90КТ20 КАК Д90КТ20
		|		ПОЛНОЕ СОЕДИНЕНИЕ Счет20 КАК Счет20
		|		ПО Д90КТ20.Подразделение = Счет20.Подразделение
		|			И Д90КТ20.НоменклатурнаяГруппа = Счет20.НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеРегБух.Подразделение, ПлановыеРасходы.Подразделение) КАК Подразделение,
		|	ЕСТЬNULL(ДанныеРегБух.НоменклатурнаяГруппа, ПлановыеРасходы.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
		|	ЕСТЬNULL(ПлановыеРасходы.РасходПлан, 0) КАК РасходПлан,
		|	ЕСТЬNULL(ДанныеРегБух.РасходФакт, 0) КАК РасходФакт,
		|	ЕСТЬNULL(ДанныеРегБух.ОстатокНЗПНаДатуРасчета, 0) КАК ОстатокНЗПНаДатуРасчета
		|ПОМЕСТИТЬ ДанныеРегистров
		|ИЗ
		|	ДанныеРегБух КАК ДанныеРегБух
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПлановыеРасходы КАК ПлановыеРасходы
		|		ПО ДанныеРегБух.Подразделение = ПлановыеРасходы.Подразделение
		|			И ДанныеРегБух.НоменклатурнаяГруппа = ПлановыеРасходы.НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРегистров.Подразделение,
		|	ДанныеРегистров.НоменклатурнаяГруппа КАК ГруппаПродукции,
		|	ДанныеРегистров.РасходПлан,
		|	ДанныеРегистров.РасходФакт,
		|	ДанныеРегистров.ОстатокНЗПНаДатуРасчета,
		|	ЕСТЬNULL(ДанныеРегистров.РасходПлан, 0) * &ПроцентРасходов / 100 КАК РасходыКСписаниюСНачалаПроекта,
		|	ЕСТЬNULL(ДанныеРегистров.РасходПлан, 0) * &ПроцентРасходов / 100 - ДанныеРегистров.РасходФакт КАК РасходыКСписаниюВТекущемПериоде,
		|	ДанныеРегистров.ОстатокНЗПНаДатуРасчета - (ЕСТЬNULL(ДанныеРегистров.РасходПлан, 0) * &ПроцентРасходов / 100 - ДанныеРегистров.РасходФакт) КАК РасчетныйОстатокНЗПНаКонецПериода
		|ИЗ
		|	ДанныеРегистров КАК ДанныеРегистров";
	
	Запрос.УстановитьПараметр("ДатаНачала", 			Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Дата(3999,1,1)));
	Запрос.УстановитьПараметр("Договор", 				Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("СчетДт", 				ПланыСчетов.Хозрасчетный.СебестоимостьПродаж);
	Запрос.УстановитьПараметр("СчетКт", 				ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Запрос.УстановитьПараметр("ПроцентРасходов", 		Объект.ПроцентРасходов);
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ_Результат = Результат.Выгрузить();
	
	Объект.Расходы.Загрузить(ТЗ_Результат);
	
	Если ТЗ_Результат.Найти(Справочники.СтруктураПредприятия.ПустаяСсылка(), "Подразделение") <> Неопределено 
		ИЛИ ТЗ_Результат.Найти(Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка(), "ГруппаПродукции") <> Неопределено Тогда
		ПроверитьПлановыеДоходыРасходы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура 	ПроверитьПлановыеДоходыРасходы()									
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеДоходыРасходыОбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.УСОERP_ПлановыеДоходыРасходы.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Договор = &Договор
		|				И Контрагент = &Контрагент
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация
		|				И (Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|					ИЛИ НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))) КАК ПлановыеДоходыРасходыОбороты";
	Запрос.УстановитьПараметр("ДатаНачала", 			Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Дата(3999,1,1)));
	Запрос.УстановитьПараметр("Договор", 				Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
		
	ПлановыеДоходыРасходы.Загрузить(Запрос.Выполнить().Выгрузить());       
		
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьВыручка(Команда)											
	
	ОчиститьВыручка(Неопределено);
	ЗаполнитьВыручкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура	ЗаполнитьВыручкаНаСервере()											
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ГруппыФинансовогоУчетаПоОбъектамСтроительства.НоменклатурнаяГруппа
		|ПОМЕСТИТЬ ДанныеРС
		|ИЗ
		|	РегистрСведений.УСОERP_ГруппыФинансовогоУчетаПоОбъектамСтроительства КАК УСОERP_ГруппыФинансовогоУчетаПоОбъектамСтроительства
		|ГДЕ
		|	УСОERP_ГруппыФинансовогоУчетаПоОбъектамСтроительства.ОбъектСтроительства = &ОбъектСтроительства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРС.НоменклатурнаяГруппа,
		|	ЕСТЬNULL(УСОERP_ПлановыеДоходыРасходыОбороты.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
		|	СУММА(ЕСТЬNULL(УСОERP_ПлановыеДоходыРасходыОбороты.ПланируемаяСуммаДоходовПоДоговоруОборот, 0)) КАК СуммаПоДоходам
		|ПОМЕСТИТЬ ДанныеРН
		|ИЗ
		|	ДанныеРС КАК ДанныеРС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ПлановыеДоходыРасходы.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				Организация = &Организация
		|					И ОбъектСтроительства = &ОбъектСтроительства
		|					И Контрагент = &Контрагент
		|					И Договор = &Договор) КАК УСОERP_ПлановыеДоходыРасходыОбороты
		|		ПО ДанныеРС.НоменклатурнаяГруппа = УСОERP_ПлановыеДоходыРасходыОбороты.НоменклатурнаяГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРС.НоменклатурнаяГруппа,
		|	ЕСТЬNULL(УСОERP_ПлановыеДоходыРасходыОбороты.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРН.Подразделение,
		|	ДанныеРН.НоменклатурнаяГруппа,
		|	СУММА(ЕСТЬNULL(КС2ВыполненоВсегоВнутренняя.Сумма, 0)) КАК СуммаВыручкаПоСправкам
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	ДанныеРН КАК ДанныеРН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РеализацияСтроительныхРаботВнутренняя.ВыполненоВсего КАК КС2ВыполненоВсегоВнутренняя
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_РеализацияСтроительныхРаботВнутренняя КАК РеализацияСтроительныхРаботВнутренняя
		|			ПО КС2ВыполненоВсегоВнутренняя.Ссылка = РеализацияСтроительныхРаботВнутренняя.Ссылка
		|		ПО ДанныеРН.Подразделение = КС2ВыполненоВсегоВнутренняя.Ссылка.Подразделение
		|			И ДанныеРН.НоменклатурнаяГруппа = КС2ВыполненоВсегоВнутренняя.НоменклатурнаяГруппа
		|ГДЕ
		|	РеализацияСтроительныхРаботВнутренняя.Проведен
		|	И РеализацияСтроительныхРаботВнутренняя.Контрагент = &Контрагент
		|	И РеализацияСтроительныхРаботВнутренняя.Договор = &Договор
		|	И РеализацияСтроительныхРаботВнутренняя.Организация = &Организация
		|	И РеализацияСтроительныхРаботВнутренняя.ОбъектСтроительства = &ОбъектСтроительства
		|	И НАЧАЛОПЕРИОДА(РеализацияСтроительныхРаботВнутренняя.Дата, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И ЕСТЬNULL(КС2ВыполненоВсегоВнутренняя.Сумма, 0) - ЕСТЬNULL(КС2ВыполненоВсегоВнутренняя.СуммаНДС, 0) <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРН.Подразделение,
		|	ДанныеРН.НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеДокументов.Подразделение, ДанныеРН.Подразделение) КАК Подразделение,
		|	ЕСТЬNULL(ДанныеДокументов.НоменклатурнаяГруппа, ДанныеРН.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
		|	ЕСТЬNULL(ДанныеРН.СуммаПоДоходам, 0) КАК СуммаПоДоходам,
		|	&ПроцентРасходов КАК ПроцентВыполнения,
		|	ЕСТЬNULL(ДанныеРН.СуммаПоДоходам, 0) * &ПроцентРасходов / 100 КАК СуммаПлановаяВыручка,
		|	ДанныеДокументов.СуммаВыручкаПоСправкам КАК СуммаВыручкаПоСправкам,
		|	ЕСТЬNULL(ДополнительныеПараметры.СуммаДоговора, 0) * &ПроцентРасходов / 100 - ДанныеДокументов.СуммаВыручкаПоСправкам КАК РазностьПланФакт
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеРН КАК ДанныеРН
		|		ПО ДанныеДокументов.Подразделение = ДанныеРН.Подразделение
		|			И ДанныеДокументов.НоменклатурнаяГруппа = ДанныеРН.НоменклатурнаяГруппа,
		|	РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору.СрезПоследних(
		|			&ДатаОкончания,
		|			ОбъектСтроительства = &ОбъектСтроительства
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор) КАК ДополнительныеПараметры";
		
	Запрос.УстановитьПараметр("ДатаНачала",				Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Дата(3999,1,1)));
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Договор", 				Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("ПроцентРасходов", 		Объект.ПроцентРасходов);
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
		
	Объект.Выручка.Загрузить(ТЗ_Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ВыручкаПриАктивизацииСтроки(Элемент)								
	
	Если Элемент.ТекущиеДанные <> Неопределено 
		И Элемент.ТекущиеДанные.Свойство("НоменклатурнаяГруппа") 
		И Элемент.ТекущиеДанные.Свойство("Подразделение") Тогда
		ВыручкаПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.НоменклатурнаяГруппа, Элемент.ТекущиеДанные.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ВыручкаПриИзменении(Элемент)										

	Если Элемент.ТекущиеДанные <> Неопределено 
		И Элемент.ТекущиеДанные.Свойство("НоменклатурнаяГруппа") 
		И Элемент.ТекущиеДанные.Свойство("Подразделение") Тогда
		ВыручкаПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.НоменклатурнаяГруппа, Элемент.ТекущиеДанные.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура	ВыручкаПриАктивизацииСтрокиНаСервере(НоменклатурнаяГруппа, Подразделение)								
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КС2ВыполненоВсегоВнутренняя.Ссылка
					|ИЗ
					|	Документ.УСОERP_РеализацияСтроительныхРаботВнутренняя.ВыполненоВсего КАК КС2ВыполненоВсегоВнутренняя
					|ГДЕ
					|	КС2ВыполненоВсегоВнутренняя.Ссылка.Проведен
					|	И КС2ВыполненоВсегоВнутренняя.Ссылка.Контрагент = &Контрагент
					|	И КС2ВыполненоВсегоВнутренняя.Ссылка.Договор = &Договор
					|	И КС2ВыполненоВсегоВнутренняя.Ссылка.Организация = &Организация
					|	И КС2ВыполненоВсегоВнутренняя.Ссылка.Подразделение = &Подразделение
					|	И КС2ВыполненоВсегоВнутренняя.Ссылка.ОбъектСтроительства = &ОбъектСтроительства
					|	И КС2ВыполненоВсегоВнутренняя.НоменклатурнаяГруппа = &ГруппаФинансовогоУчета
					|	И НАЧАЛОПЕРИОДА(КС2ВыполненоВсегоВнутренняя.Ссылка.Дата, ДЕНЬ) <= &ДатаОкончания
					|
					|СГРУППИРОВАТЬ ПО
					|	КС2ВыполненоВсегоВнутренняя.Ссылка";
					
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Договор", 				Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", 			Подразделение);
	Запрос.УстановитьПараметр("ГруппаФинансовогоУчета", НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("ДатаОкончания", 			?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Дата(3999,1,1)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СсылкиНаСправки = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		СсылкиНаСправки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СправкиПоВыручке.Параметры.УстановитьЗначениеПараметра("ТаблицаСсылок",				СсылкиНаСправки);
	СправкиПоВыручке.Параметры.УстановитьЗначениеПараметра("ГруппаФинансовогоУчета", 	НоменклатурнаяГруппа);
				
КонецПроцедуры

&НаКлиенте
Процедура 	РассчитатьОбъемРабот(Команда)										
	
	РассчитатьОбъемРаботНаСервере();		
	
КонецПроцедуры

&НаСервере
Процедура 	РассчитатьОбъемРаботНаСервере()										
	
	ПроцентВыполнения 	= 0;
	КоличествоЭлементов = 0;
	
	тТаблица = Объект.ОбъемРабот.Выгрузить(Новый Массив);
	ДеревоОбъемРабот = РеквизитФормыВЗначение("ОбъемРабот");
	ПреобразоватьВТЗРекурсия(ДеревоОбъемРабот, тТаблица);
	
	Для Каждого ТекСтрока Из тТаблица Цикл
		Если НЕ ТекСтрока.Работа.СуммарнаяРабота И НЕ Объект.СпособРасчетаПоВедущейРаботе Тогда 
			ПроцентВыполнения = ПроцентВыполнения + ТекСтрока.ПроцентВыполнения;
			КоличествоЭлементов = КоличествоЭлементов + 1;
		ИначеЕсли НЕ ТекСтрока.Работа.СуммарнаяРабота И Объект.СпособРасчетаПоВедущейРаботе И ТекСтрока.ВедущийПроцесс Тогда
			ПроцентВыполнения = ПроцентВыполнения + ТекСтрока.ПроцентВыполнения * ТекСтрока.Работа.ДоляПроекта / 100;
			КоличествоЭлементов = КоличествоЭлементов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.СпособРасчетаПоВедущейРаботе Тогда
		Объект.ПроцентРасходов = ?(КоличествоЭлементов > 0, ПроцентВыполнения, 0);
	Иначе 
		Объект.ПроцентРасходов = ?(КоличествоЭлементов > 0, ПроцентВыполнения / КоличествоЭлементов, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	СпособРасчетаПоВедущейРаботеПриИзменении(Элемент)					
	
	Элементы.ОбъемРаботВедущийПроцесс.ТолькоПросмотр = НЕ Объект.СпособРасчетаПоВедущейРаботе;
	
КонецПроцедуры

&НаКлиенте
Процедура 	СправкиПоВыручкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)								
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.РеализацияСтроительныхРаботКС2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
	Объект.ОбъемРабот.Очистить();
	Объект.Расходы.Очистить();
	Объект.Выручка.Очистить();
	ОбъемРабот.ПолучитьЭлементы().Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыОткрытия 	= Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыОткрытия, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ДатаНачала = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = КонецДня(РезультатВыбора.КонецПериода);
	
КонецПроцедуры


#КонецОбласти
